### Resource changes jake-sltest [01JYH1RJ5FVT8Y8CEYNZ9DPXQN] Planning changes with 0 custom hooks...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "dev"
        }
      + tags_all                    = {
          + "Name" = "dev"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # random_integer.random will be created
  + resource "random_integer" "random" {
      + id     = (known after apply)
      + max    = 10000
      + min    = 1
      + result = (known after apply)
    }

  # random_string.random will be created
  + resource "random_string" "random" {
      + id          = (known after apply)
      + length      = 10
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + variable = "dev"
[01JYH1RJ5FVT8Y8CEYNZ9DPXQN] Changes are GO
[01JYH1RJ5FVT8Y8CEYNZ9DPXQN] Uploading the list of managed resources...
[01JYH1RJ5FVT8Y8CEYNZ9DPXQN] Please be aware that the run changes calculation includes output changes.
[01JYH1RJ5FVT8Y8CEYNZ9DPXQN] Resource list upload is GO
[01JYH1RJ5FVT8Y8CEYNZ9DPXQN] Generating JSON representation of the plan...
[01JYH1RJ5FVT8Y8CEYNZ9DPXQN] JSON representation is GO
[01JYH1RJ5FVT8Y8CEYNZ9DPXQN] Loading custom plan policy inputs...
[01JYH1RJ5FVT8Y8CEYNZ9DPXQN] 0 custom plan policy inputs found
[01JYH1RJ5FVT8Y8CEYNZ9DPXQN] Evaluated 1 plan policy
[01JYH1RJ5FVT8Y8CEYNZ9DPXQN] Plan checks are GO platformcon-s3 %!(EXTRA string=01JYH9VYY8QFP6V1DXJRP3AZMA, int=3, int=0, int=0)
| Added | `aws_s3_bucket.this` | <details><summary>Value</summary>`{"force_destroy": false, "tags": {"Name": "dev"}, "tags_all": {"Name": "dev"}, "timeouts": null}`</details> |
| Added | `random_integer.random` | <details><summary>Value</summary>`{"keepers": null, "max": 10000, "min": 1, "seed": null}`</details> |
| Added | `random_string.random` | <details><summary>Value</summary>`{"keepers": null, "length": 10, "lower": true, "min_lower": 0, "min_numeric": 0, "min_special": 0, "min_upper": 0, "number": true, "numeric": true, "override_special": null, "special": false, "upper": false}`</details> |
